var article = {
    "article": [
        {
            "title": "读《道连·格雷的画像》有感",
            "time": "2016年9月16日",
            "content": " <p>这几天翻完了19世纪爱尔兰唯美主义作家王尔德的著名小说《道连·格雷的画像》，见证了一个俊美的青年是如何被一些话语教唆成为罪恶之人。小说中传达出来的一些东西需要自己警醒。</p><p>1. 生活需要真实</p><p>不真实的生活是道连最后悲剧的原因之一，在其人生后期，其掩盖自己的身份在贫民窟逗留，吸食鸦片欺骗他人，甚至杀害了自己的朋友，但还觉得这只不过是自己人生的小小污点。这种不真实到最后还是被他人所察觉或是怀疑。在小说的最后，两位绅士对于道连的生死的反应是：“冷笑一声走掉了”。很明显在道连所处的阶级中，其风评是很差的。这和我何其相似？！我去网吧花费大量时间和精力玩守望先锋，在网络上收集黄色漫画以及图片，不去锻炼不注意饮食，不注意人际交往以至于没有好朋友没有足够的信息。虽然这并不是很大的作恶（？），但是减少了我做善以及自我提升的时间。并没有自己努力争取自己想要的东西，在这种什么都不做的情况下还是希望获得成功，这和妄想症何其相似？如果不加以改变，悲剧必然是等待着我的。（ps 如果如果一个人想不受环境的影响，有两种方式：割裂环境或者割裂自己）</p><p>2. 需要珍惜时间</p><p>20岁出头的时间是最为宝贵的。道连·格雷的人生最有戏剧性质的就是其容颜一直保留在20多岁，但是其灵魂是越来越不洁的，而这种道德上的变坏表现在了他早年肖像画上。直至他40岁决定破坏那幅画而导致自己死亡的时候，他内心的污秽才在他的肉体显现了出来。无论如何，20多岁是一个人精力和颜值的巅峰，作者正是以道连·格雷“永恒的”20岁的美好外貌来和内心的不断堕落来做对比，强化了文章的戏剧性，为最后的悲剧结局做好了铺垫。</p><p>3. 生活是感性的</p><blockquote><p>生活是个神经的问题，纤维的问题，是逐渐进化而成的细胞的问题，其中埋藏了思想，激情在其中有着它的梦。我们生活所依靠的不过是屋子里或早上的天空里一抹随意的颜色；曾经爱过的一种带着你细腻的回忆的特别香味；偶然遇见的已经忘却的诗行；或是已经不再弹奏的乐曲中的一段旋律。</p></blockquote>"
        },
        {
            "title": "Web Development",
            "time": "2017年4月2日",
            "content": "<p>本文是维基百科相关页面的翻译，主要介绍了前端编程的三大工具以及发展目的。</p><hr><p>前端网络编程，也被认为是用户端编程，是为了网页或者网页应用，而编写HTML，CSS以及JS代码，所以用户能够看到并且和这些页面进行交流。前端网络编程的挑战在于用于实现前端页面的工具以及技术变化得很快，所以工程师需要不断注意产业是如何发展的（例如去年的ECMAScript 6）。</p><p>设计网页的目的在于：确保用户打开站点的时候，信息是以容易阅读并且相互关联的形式呈现的。随之带来的问题是，现在用户实用大量的设备来访问网页，这些设备具有不同的屏幕尺寸以及清晰度。所以设计者在设计网页的时候需要注意这些方面。他们需要确保他们的网页在不同的浏览器、不同的操作系统以及不同的设备上显示正确，这需要在工程师端进行仔细的计划。</p><hr><h2>前端网络编程所使用的工具</h2><p>这里有一些工具能被用于进行前端编程，理解工具最适用于哪些任务，这有助于产生一个高质量的、可升级的站点。</p><h4>超文本标记语言（HTML）：</h4><p>HTML是任何网页工程程序的骨架，没有它网页不会存在。超文本标记语言能提供站点总体的样子。HTML被Tim Berners-Lee所发展。随着HTML的发展，在万维网中产生了许多版本。最新版本的超文本标记语言被称为HTML5，在2014年0月28日被W3所推出。这一版本包含了新的并且高效的方式来传输元素，例如音频以及视频文件。H5在前端工程师中非常受欢迎。和老的版本相比，HTML5有很多特点。</p><p>随着HTML的发展，在网络中产生了一场革命。现在，世界开始通过同一种语言相互交流，那就是超文本标记语言。其由两种部分组成，第一是<b>超文本</b>（就是超链接），第二是<b>标记语言</b>。</p><h4>层叠样式列表（CSS）：</h4><p>CSS控制了站点的样子，让你的站点有自己独有的外观。其实现形式是：保证样式列表先于其他的样式规则，由其他的输入形式所影响，例如屏幕的尺寸和分辨率。</p><h4>JS：</h4><p>JS是基于场景的命令式语言（和HTML的说明性语言不同），用于将静态的HTML界面动态化。JS的代码能使用HTML标准提供的<b>文档对象模型</b>（DOM），来根据事件，例如用户的输入，操纵网络页面。</p><p>使用一种被称为<b>异步JavaScript和XML</b>的技术（AJAX），JS代码也能动态的改变网页的内容（与原始的HTML页面端相独立），并且也能回应服务端的事件，让网页体验增加了真正动态的特性。<br></p><hr><h2>发展的目的</h2><p>前端工程师牢记以下要点，使用可获得的工具以及技术来到达后端。</p><h4>可达性：</h4><p>随着移动设备（例如例如手机和平板）的持续发展，设计者需要确保他们的站点在所有的设备中的浏览器正确运行。这能通过在CSS的样式列表中使用响应式的网页设计"
        },
    ]
};

article.display = function(){
    for(var article = 0; article<this.article.length; article++){
        $(".article").append(HTMLBlogHead);
        console.log(HTMLBlogTitle);
        var formattedTitle = HTMLBlogTitle.replace("%data%", this.article[article].title);
        var formattedTime = HTMLBlogTime.replace("%data%", this.article[article].time);
        var formattedOrder = HTMLBlogOrder.replace("%data%",article+1);
        var formattedContent = HTMLBlogContent.replace("%data%", this.article[article].content);

        $('.blogHead:last').append(formattedTitle);
        $('.blogHead:last').append(HTMLBlogSenconTitle);
        $('.secondaryText:last').append(formattedOrder);
        $('.secondaryText:last').append(formattedTime);
        $('.article:last').append(formattedContent)
    }
}

article.display();